#include<stdio.h>

int main() {
	int arr_1[3] = { 10,20,30 }; // 1차원 배열

	//배열명[행/줄][열/데이터갯수]
	int arr_2[3][4] = {
		{10,20,30,40}, //0행
		{11,21,31,41}, //1행
		{12,22,32,42}  //2행
	//    0  1  2  3열
	};
	//실제 저장방식
	// = int arr_2[3][4] = { {10,20,30,40}, {11,21,31,41}, {12,22,32,42} };
	
	//2차원 배열 index
	printf("10=%d\n", arr_2[0][0]);
	printf("31=%d\n", arr_2[1][2]);

	//배열의 모든 요소 출력
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 4; j++) { printf("%d ", arr_2[i][j]); }
		printf("\n");
	}






}